# [ 텍스트 데이터 처리 ]
    - 다양한 형태의 텍스트 데이터를 정리하기 위한 방법들
    - Series에 str 속성을 활용해서 str제공 전용 메서드 사용 가능
    - 사용 방법 : Series 객체변수명.str.메서드()

#### - 문자열 관련 메서드들 살펴보기
#### (1) 공백 제거 관련 메서드 => stip(), lstrip(), rstrip()

In [170]:
msg = "   Merry Christmas      "

In [171]:
len(msg)

24

In [172]:
msg1, msg2, msg3 = msg.strip(), msg.lstrip(), msg.rstrip()
len(msg1), len(msg2), len(msg3)

(15, 21, 18)

## <hr> (1) 모듈 로딩

In [173]:
import pandas as pd
import numpy as np

## <hr> (2) 데이터 준비

In [174]:
file = '../DATA/chicago_food_inspections.csv'

## <hr> (3) 데이터 저장

In [175]:
chicagoDF=pd.read_csv(file)

## <hr> (4) 데이터 확인

In [176]:
chicagoDF.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 153810 entries, 0 to 153809
Data columns (total 2 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   Name    153810 non-null  object
 1   Risk    153744 non-null  object
dtypes: object(2)
memory usage: 2.3+ MB

In [177]:
chicagoDF.head()

                          Name             Risk
0   MARRIOT MARQUIS CHICAGO       Risk 1 (High)
1                  JETS PIZZA   Risk 2 (Medium)
2                   ROOM 1520      Risk 3 (Low)
3    MARRIOT MARQUIS CHICAGO      Risk 1 (High)
4                CHARTWELLS       Risk 1 (High)

#### - [문제] Name 컬럼에서 공백제거 처리

In [178]:
chicagoDF['Name'] = chicagoDF['Name'].str.strip()
chicagoDF

                                Name             Risk
0            MARRIOT MARQUIS CHICAGO    Risk 1 (High)
1                         JETS PIZZA  Risk 2 (Medium)
2                          ROOM 1520     Risk 3 (Low)
3            MARRIOT MARQUIS CHICAGO    Risk 1 (High)
4                         CHARTWELLS    Risk 1 (High)
...                              ...              ...
153805                     WOLCOTT'S    Risk 1 (High)
153806  DUNKIN DONUTS/BASKIN-ROBBINS  Risk 2 (Medium)
153807                      Cafe 608    Risk 1 (High)
153808                   mr.daniel's    Risk 1 (High)
153809                    TEMPO CAFE    Risk 1 (High)

[153810 rows x 2 columns]

In [179]:
chicagoDF.columns

Index(['Name', 'Risk'], dtype='object')

In [180]:
chicagoDF["Name"].str.lower().head()

0    marriot marquis chicago
1                 jets pizza
2                  room 1520
3    marriot marquis chicago
4                 chartwells
Name: Name, dtype: object

In [181]:
chicagoDF["Name"].str.upper().head()

0    MARRIOT MARQUIS CHICAGO
1                 JETS PIZZA
2                  ROOM 1520
3    MARRIOT MARQUIS CHICAGO
4                 CHARTWELLS
Name: Name, dtype: object

In [182]:
chicagoDF["Name"].str.capitalize().head()

0    Marriot marquis chicago
1                 Jets pizza
2                  Room 1520
3    Marriot marquis chicago
4                 Chartwells
Name: Name, dtype: object

In [183]:
chicagoDF["Name"].str.title().head()

0    Marriot Marquis Chicago
1                 Jets Pizza
2                  Room 1520
3    Marriot Marquis Chicago
4                 Chartwells
Name: Name, dtype: object

#### [문제] Risk 컬럼에서 문자열 나누기 => Risk 숫자 => Risk와 숫자 분리

In [184]:
chicagoDF["Risk"].head()

0      Risk 1 (High)
1    Risk 2 (Medium)
2       Risk 3 (Low)
3      Risk 1 (High)
4      Risk 1 (High)
Name: Risk, dtype: object

In [185]:
len(chicagoDF)

153810

In [186]:
chicagoDF["Risk"].nunique(), chicagoDF["Risk"].unique()

(4,
 array(['Risk 1 (High)', 'Risk 2 (Medium)', 'Risk 3 (Low)', 'All', nan],
       dtype=object))

In [187]:
chicagoDF["Risk"].isna().sum(), chicagoDF.isna().sum()

(66,
 Name     0
 Risk    66
 dtype: int64)

In [188]:
# 기본 => 행 방향, 행 내에 한 개라도 NaN이 있으면 삭제
chicagoDF.dropna().shape

(153744, 2)

In [189]:
# Risk 컬럼이 NaN인 행 삭제 => subset 파라미터 적용
chicagoDF.dropna(subset = ["Risk"]).shape

(153744, 2)

In [190]:
# 원소의 데이터 값이 'all' => 'Risk 4 (Extreme)' 변경
chicagoDF["Risk"].replace('all', 'Risk 4(Extreme)')

0           Risk 1 (High)
1         Risk 2 (Medium)
2            Risk 3 (Low)
3           Risk 1 (High)
4           Risk 1 (High)
               ...
153805      Risk 1 (High)
153806    Risk 2 (Medium)
153807      Risk 1 (High)
153808      Risk 1 (High)
153809      Risk 1 (High)
Name: Risk, Length: 153810, dtype: object

In [192]:
chicagoDF['Risk'].str.slice(5,6)

0         1
1         2
2         3
3         1
4         1
         ..
153805    1
153806    2
153807    1
153808    1
153809    1
Name: Risk, Length: 153810, dtype: object

In [193]:
chicagoDF['Risk'].str.slice(8,-1).str.upper()

0           HIGH
1         MEDIUM
2            LOW
3           HIGH
4           HIGH
           ...
153805      HIGH
153806    MEDIUM
153807      HIGH
153808      HIGH
153809      HIGH
Name: Risk, Length: 153810, dtype: object